-- MySQL dump 10.13  Distrib 8.0.18, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: zhengkaixin1
-- ------------------------------------------------------
-- Server version	8.0.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `testbase`
--

DROP TABLE IF EXISTS `testbase`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `testbase` (
  `province` varchar(40) DEFAULT NULL,
  `city` varchar(40) DEFAULT NULL,
  `adcode` varchar(40) DEFAULT NULL,
  `status` varchar(40) DEFAULT NULL,
  `count` varchar(40) DEFAULT NULL,
  `info` varchar(40) DEFAULT NULL,
  `infocode` varchar(40) DEFAULT NULL,
  `weather` varchar(40) DEFAULT NULL,
  `temperature` varchar(40) DEFAULT NULL,
  `winddirection` varchar(40) DEFAULT NULL,
  `windpower` varchar(40) DEFAULT NULL,
  `humidity` varchar(40) DEFAULT NULL,
  `reporttime` varchar(40) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `testbase`
--

LOCK TABLES `testbase` WRITE;
/*!40000 ALTER TABLE `testbase` DISABLE KEYS */;
INSERT INTO `testbase` VALUES ('北京','北京市','110000','1','1','OK','10000','晴','-4','北','≤3','77','2020-01-09 00:36:05'),('天津','天津市','120000','1','1','OK','10000','晴','-2','北','≤3','70','2020-01-09 00:35:02'),('河北','河北省','130000','1','1','OK','10000','雾','-3','西南','≤3','88','2020-01-09 00:31:22'),('山西','山西省','140000','1','1','OK','10000','晴','-3','西南','≤3','85','2020-01-09 00:36:09'),('内蒙古','内蒙古自治区','150000','1','1','OK','10000','晴','-14','西北','≤3','75','2020-01-09 00:24:03'),('辽宁','辽宁省','210000','1','1','OK','10000','多云','-7','南','≤3','84','2020-01-09 00:21:54'),('吉林','吉林省','220000','1','1','OK','10000','多云','-13','西','≤3','94','2020-01-09 00:34:40'),('黑龙江','黑龙江省','230000','1','1','OK','10000','多云','-19','西','≤3','82','2020-01-09 00:22:21'),('上海','上海市','310000','1','1','OK','10000','阴','5','北','≤3','62','2020-01-09 00:27:19'),('江苏','江苏省','320000','1','1','OK','10000','阴','3','北','≤3','85','2020-01-09 00:26:53'),('浙江','浙江省','330000','1','1','OK','10000','阴','4','东北','≤3','71','2020-01-09 00:29:49'),('安徽','安徽省','340000','1','1','OK','10000','雨夹雪','0','东','≤3','99','2020-01-09 00:26:05'),('福建','福建省','350000','1','1','OK','10000','阴','12','东','≤3','62','2020-01-09 00:27:23'),('江西','江西省','360000','1','1','OK','10000','多云','6','东北','≤3','73','2020-01-09 00:33:05'),('山东','山东省','370000','1','1','OK','10000','晴','-4','东南','≤3','87','2020-01-09 00:27:46'),('河南','河南省','410000','1','1','OK','10000','多云','2','东','≤3','63','2020-01-09 00:23:21'),('湖北','湖北省','420000','1','1','OK','10000','雨','2','东','≤3','94','2020-01-09 00:22:53'),('湖南','湖南省','430000','1','1','OK','10000','多云','5','西北','≤3','84','2020-01-09 00:25:33'),('广东','广东省','440000','1','1','OK','10000','多云','19','北','≤3','67','2020-01-09 00:24:30'),('广西','广西壮族自治区','450000','1','1','OK','10000','多云','19','南','≤3','95','2020-01-09 00:30:23'),('海南','海南省','460000','1','1','OK','10000','多云','20','东','≤3','91','2020-01-09 00:29:23'),('重庆','重庆市','500000','1','1','OK','10000','雨','8','西北','≤3','95','2020-01-09 00:29:13'),('四川','四川省','510000','1','1','OK','10000','阴','8','北','≤3','73','2020-01-09 00:33:39'),('贵州','贵州省','520000','1','1','OK','10000','阴','10','南','≤3','85','2020-01-09 00:28:50'),('云南','云南省','530000','1','1','OK','10000','晴','12','西','≤3','64','2020-01-09 00:35:11'),('西藏','西藏自治区','540000','1','1','OK','10000','多云','0','南','≤3','26','2020-01-09 00:26:33'),('陕西','陕西省','610000','1','1','OK','10000','阴','1','西','≤3','91','2020-01-09 00:28:22'),('甘肃','甘肃省','620000','1','1','OK','10000','多云','-1','西北','≤3','64','2020-01-09 00:32:31'),('青海','青海省','630000','1','1','OK','10000','多云','-4','东南','≤3','76','2020-01-09 00:29:30'),('宁夏','宁夏回族自治区','640000','1','1','OK','10000','多云','-6','北','≤3','69','2020-01-09 00:29:42'),('新疆','新疆维吾尔自治区','650000','1','1','OK','10000','多云','-17','北','≤3','84','2020-01-09 00:25:04');
/*!40000 ALTER TABLE `testbase` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-01-09 21:03:10
